.emacs.d/customisations/core.org
#+TITLE: Core Configurations
#+PROPERTY: header-args :tangle core.el :results silent

* Package Initialization

Start by setting up package.el and ensuring `use-package` is available.

#+BEGIN_SRC emacs-lisp
;; ***************
;;; Initialize package management
;; ***************

(require 'package)
(setq package-enable-at-startup nil)
(setq package-archives '(("gnu" . "https://elpa.gnu.org/packages/")
                         ("melpa" . "https://melpa.org/packages/")))

(package-initialize)

;; Fetch the list of packages available 
(unless package-archive-contents (package-refresh-contents))

;; Install use-package
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(setq use-package-always-ensure t)
#+END_SRC
